package com.zpwan.appcommon.enums;

/**
 * 错误枚举常量
 *
 * @author 吴爱军
 */
public enum ErrorCodeEnum {

    /** ================ 通用 ===============*/
    /**
     * {}
     */
    E4001000(4001000),

    /**
     * 未登录
     */
    E4001001(4001001),

    /**
     * 未登录令牌已失效,请尝试重新登录
     */
    E4001002(4001002),

    /**
     * 您无权限访问
     */
    E4001003(4001003),

    /**
     * {}不存在
     */
    E4001004(4001004),

    /**
     * 获取用户信息失败
     */
    E4001005(4001005),

    /**
     * {}已经存在
     */
    E4001006(4001006),

    /**
     * {}已被使用
     */
    E4001007(4001007),

    /**
     * 非法参数
     */
    E4001008(4001008),

    /**
     * {}不能为空
     */
    E4001009(4001009),

    /**
     * {}操作失败
     */
    E4001010(4001010),

    /**
     * 请求超时
     */
    E4001011(4001011),

    /**
     * 服务异常
     */
    E4001012(4001012),

    /**
     * 验证码过期
     */
    E4001013(4001013),

    /**
     * 验证码无效
     */
    E4001014(4001014),

    /**
     * 签名验证失败
     */
    E4001016(4001016),

    /**
     * 开户失败{}
     */
    E4001017(4001017),

    /**
     * 用户未审核或审核未通过
     */
    E4001018(4001018),

    /**
     * {}被禁用
     */
    E4001019(4001019),

    /**
     * {}不正确
     */
    E4001020(4001020),

    /**
     * 请勿频繁请求
     */
    E4001021(4001021),

    /**
     * 该用户已经在另一个地方登录,被迫下线!
     */
    E4001022(4001022),

    /** ================ service-asset 服务 =============== */
    /**
     * 您有一笔授信申请未完成，不能再次发起申请！
     */
    E4002001(4002001),

    /**
     * 您还在拒绝申请期内，不能再次发起申请！
     */
    E4002002(4002002),

    /**
     * 该用户名下，没有当前可用的授信
     */
    E4002003(4002003),

    /**
     * 产品信息异常，请重新提交
     */
    E4002004(4002004),

    /**
     * 您的授信担保流程未完成，请查看进度。
     */
    E4002005(4002005),

    /**
     * 您的账户未开户绑卡，暂时不能发起借款
     */
    E4002006(4002006),

    /**
     * 您的资金账户正在开户中，暂时不能发起借款，请耐心等待！
     */
    E4002007(4002007),

    /**
     * 提交失败
     */
    E4002008(4002008),

    /**
     * 审核时，还款策略不能为空
     */
    E4002009(4002009),

    /**
     * 您申请的授信额度，不能高于产品的最大值
     */
    E4002010(4002010),

    /**
     * 用户当前授信中没有可用的产品策略
     */
    E4002011(4002011),

    /**
     * 这不是您的授信，不可操作
     */
    E4002012(4002012),

    /**
     * 您已有当前可用授信，不可再次申请
     */
    E4002013(4002013),

    /**
     * 您的当前有未结清贷款，请结清后再借款。
     */
    E4002014(4002014),

    /**
     * 您有一笔借款申请未完成，不能再次发起申请！
     */
    E4002015(4002015),

    /**
     * 借款金额不得少于{}
     */
    E4002016(4002016),

    /**
     * 您填写的借款金额超过可借额度
     */
    E4002017(4002017),

    /**
     * 您填写的借款金额需为整数
     */
    E4002018(4002018),

    /**
     * 您选择的产品已下架，请选择其他产品
     */
    E4002019(4002019),

    /**
     * 您申请的授信额度，不能低于产品的最小值
     */
    E4002020(4002020),

    /**
     * 您需要先添加担保申请
     */
    E4002021(4002021),

    /**
     * 您不可提交自己作为担保人
     */
    E4002022(4002022),

    /**
     * 您已经提交过该用户手机号为担保人，不可重复提交同一人
     */
    E4002023(4002023),

    /**
     * 您的资金账户未开户，请先去开户
     */
    E4002024(4002024),

    /**
     * 您的资金账户正在开户中，暂时不可添加担保人，请耐心等待
     */
    E4002025(4002025),

    /**
     * 当前授信已过期，不可修改
     */
    E4002026(4002026),

    /**
     * 编辑授信额度不能大于授信审批额度
     */
    E4002027(4002027),

    /**
     * 可用额度为0，不可借款
     */
    E4002028(4002028),

    /**
     * 授信额度需为整数，请重新填写
     */
    E4002029(4002029),

    /** ================ service-fundflow 服务 =============== */
    /**
     * {}操作失败，未知错误
     */
    E4003001(4003001),

    /**
     * {}服务异常
     */
    E4003002(4003002),

    /**
     * 创建资金账户失败，{}
     */
    E4003003(4003003),

    /**
     * 充值失败，{}
     */
    E4003004(4003004),

    /**
     * 还款账单已经结清
     */
    E4003005(4003005),

    /**
     * 还款账单已经结清
     */
    E4003006(4003006),

    /**
     * 订单已处理
     */
    E4003007(4003007),

    /**
     * 账单已全部结清
     */
    E4003008(4003008),

    /**
     * 绑卡失败，{}
     */
    E4003009(4003009),

    /**
     * 卡BIN查询失败，{}
     */
    E4003010(4003010),

    /**
     * 绑卡信息查询失败，{}
     */
    E4003011(4003011),

    /**
     * 账户信息查询失败，{}
     */
    E4003012(4003012),

    /**
     * 金融开户失败，{}
     */
    E4003013(4003013),

    /**
     * 提前结清失败，{}
     */
    E4003014(4003014),

    /**
     * 还款失败，{}
     */
    E4003015(4003015),

    /**
     * 放款失败，{}
     */
    E4003016(4003016),

    /**
     * 终止放款失败，{}
     */
    E4003017(4003017),

    /**
     * 至少勾选一条记录；
     */
    E4003018(4003018),

    /**
     * 出账账户和入账账户不可相同；
     */
    E4003019(4003019),

    /**
     * 手机号不存在，{}
     */
    E4003020(4003020),

    /**
     * 资金账户不存在，{}
     */
    E4003021(4003021),

    /**
     * 调账失败，{}
     */
    E4003022(4003022),

    /**
     * 调账已审核，不可再次审核；
     */
    E4003023(4003023),

    /** ================ service-party 服务 =============== */
    /**
     * 用户不一致,需请重新登录
     */
    E4004001(4004001),

    /**
     * 用户不存在,或被禁用
     */
    E4004002(4004002),
    /**
     * 用户已存在
     */
    E4004003(4004003),

    /** ================ service-product 服务 =============== */
    /**
     * demo
     */
    E4005001(4005001),

    /** ================ service-workflow 服务 =============== */
    /**
     * 工作流审核条件配置错误
     */
    E4006001(4006001),
    /**
     * 无符合条件流程
     */
    E4006002(4006002),

    /** ================ app-admin 服务 =============== */
    /**
     * {}额度不得大于实际申请额度
     */
    E5001001(5001001),

    /**
     * 贷款状态不能放款
     */
    E5001002(5001002),

    /**
     * 店铺数不能超过4家
     */
    E5001003(5001003),
    /**
     * 授信额度不能小于产品设置最低额度
     */
    E5001004(5001004),
    /**
     * {}已被签收
     */
    E5001005(5001005),
    /**
     * 当前用户有单子签收未完成
     */
    E5001006(5001006),
    /**
     * {}信息不完整，请补全
     */
    E5001007(5001007),
    /**
     * 担保申请已审核
     */
    E5001008(5001008),
    /**
     * 授信申请已审核
     */
    E5001009(5001009),
    /** ================ app-common 服务 =============== */
    /**
     * 还款定时任务执行失败
     */
    E5002001(5002001),

    /** ================ app-mijin 服务 =============== */
    /**
     * {}失败，稍后再试
     */
    E5003001(5003001),

    /**
     * 贷款申请状态不能提前结清
     */
    E5003002(5003002),

    /**
     * 今天运营商认证次数已使用完
     */
    E5003003(5003003),


    /**
     * 请先实名认证
     */
    E5003004(5003004),

    /**
     * 该账单已结清，请不要重复还款
     */
    E5003005(5003005),

    E5003006(5003006),
    /**
     * 当前合同已失效
     */
    E5003007(5003007),
    /**
     * {}金额不能小于1
     */
    E5003008(5003008),
    /**
     * {}金额只能保存两位小数
     */
    E5003009(5003009),
    //    开户成功
    E5003010(5003010);
    int errorCode;

    ErrorCodeEnum(int errorCode) {
        this.errorCode = errorCode;
    }

    public int getErrorCode() {
        return this.errorCode;
    }

}
